tap "adoptopenjdk/openjdk"
tap "crisidev/chunkwm"
tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "microsoft/mssql-release"
tap "mongodb/brew"
tap "sass/sass"
# Shell plugin manager
brew "antibody"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Collection of portable C++ source libraries
brew "boost"
# Portable Foreign Function Interface library
brew "libffi"
# Core application library for C
brew "glib"
# Like cat but displays content with syntax highlighting
brew "ccat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Programming language for highly scalable real-time systems
brew "erlang"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# GNU compiler collection
brew "gcc@6"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# Geometry Engine
brew "geos"
# Distributed revision control system
brew "git"
# Manage compile and link flags for libraries
brew "pkg-config"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Kubernetes command-line interface
brew "kubernetes-cli"
# X.509 and CMS library
brew "libksba"
# YAML Parser
brew "libyaml"
# GUI for vim, made for macOS
brew "macvim"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn", restart_service: true
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv"
# Object-relational database system
brew "postgresql", restart_service: true
# Cartographic Projections Library
brew "proj"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Alternative to pyenv for managing virtualenvs
brew "pyenv-virtualenvwrapper"
# Emulator for x86 and PowerPC
brew "qemu"
# Messaging broker
brew "rabbitmq"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Rust toolchain installer
brew "rustup-init"
# Dynamic infrastructure communication bus
brew "salt"
# Cross-shell prompt for astronauts
brew "starship"
# High-performance system programming language
brew "swift"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Implementation of Java Servlet and JavaServer Pages
brew "tomcat@8"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools"
# An interactive JavaScript command-line interface to MongoDB
brew "mongodb/brew/mongodb-community-shell"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Prebuilt OpenJDK binaries
cask "adoptopenjdk8"
# Application launcher and productivity software
cask "alfred"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Text editor
cask "atom"
# Web browser focusing on privacy
cask "brave-browser"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Clipboard extension app
cask "clipy"
# Free universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerized applications and microservices
cask "docker"
# Tool to hide status bar icons
cask "dozer"
# Draw.io is free online diagram software
cask "drawio"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Clipboard manager for developers
cask "flycut"
cask "font-fira-code"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
cask "helium"
# Terminal built on web technologies
cask "hyper"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
cask "java"
# Clipboard manager
cask "jumpcut"
# Visual user interface for Docker Container management
cask "kitematic"
# Office suite
cask "libreoffice"
cask "minikube"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
cask "phantomjs"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
cask "simplenote"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Move and resize windows with ease
cask "spectacle"
cask "sql-operations-studio"
# System monitor for the menu bar
cask "stats"
# Application for inspecting installer packages
cask "suspicious-package"
# Unpacks archive files
cask "the-unarchiver"
# Customizable timing of breaks
cask "time-out"
# Pomodoro desktop timer
cask "tomighty"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Run commands and display their output on the desktop
cask "ubersicht"
cask "ukelele"
# Development environment
cask "vagrant"
cask "vagrant-manager"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Web browser focusing on customization and control
cask "vivaldi"
cask "webpquicklook"
# Desktop client for WhatsApp
cask "whatsapp"
# Open-source version of the X.Org X Window System
cask "xquartz"
mas "Flycut", id: 442160987
mas "Flycut", id: 442160987
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "ScreenBrush", id: 1233965871
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
